IDENTIFICATION DIVISION.
PROGRAM-ID. ORACOLO-PERFORATO.
AUTHOR. UN-PROGRAMMATORE-NOSTALGICO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-SEME               PIC 9(8).
01 WS-CASUALE            PIC 9V9(4).
01 WS-INDICE             PIC 9(2).
01 WS-INVIO              PIC X.

01 WS-FRASI.
   05 FILLER PIC X(40) VALUE "IL TUO CODICE COMPILERA' AL PRIMO COLPO".
   05 FILLER PIC X(40) VALUE "UN GOTO TI ASPETTA DIETRO L'ANGOLO".
   05 FILLER PIC X(40) VALUE "TROVERAI UN PUNTO E VIRGOLA MANCANTE".
   05 FILLER PIC X(40) VALUE "IL DESTINO E' SCRITTO SU SCHEDA PERFORATA".
   05 FILLER PIC X(40) VALUE "UN COBOL PROGRAMMER NON MUORE, RESTA IN PROD".
   05 FILLER PIC X(40) VALUE "ATTENTO: RISCHIO DI ABEND IMMINENTE".
   05 FILLER PIC X(40) VALUE "LA TUA FORTUNA E' IN BATCH, RIPROVA STASERA".
   05 FILLER PIC X(40) VALUE "UN CICLO PERFORM TI PORTERA' LONTANO".

01 WS-FRASI-TAB REDEFINES WS-FRASI.
   05 WS-FRASE OCCURS 8 TIMES PIC X(40).

PROCEDURE DIVISION.
    DISPLAY "+------------------------------------------+".
    DISPLAY "|   ORACOLO PERFORATO - IBM 029 EMULATION   |".
    DISPLAY "+------------------------------------------+".
    DISPLAY "Premi INVIO per perforare la tua sorte...".
    ACCEPT WS-INVIO.

    ACCEPT WS-SEME FROM TIME.
    COMPUTE WS-CASUALE = FUNCTION RANDOM(WS-SEME).
    COMPUTE WS-INDICE = (WS-CASUALE * 8) + 1.

    IF WS-INDICE > 8
        MOVE 8 TO WS-INDICE
    END-IF.

    DISPLAY " ".
    DISPLAY "  . . . . . . . . . . . . . . . . . . . .".
    DISPLAY " .                                        .".
    DISPLAY "|  " WS-FRASE(WS-INDICE) "  |".
    DISPLAY " .                                        .".
    DISPLAY "  . . . . . . . . . . . . . . . . . . . .".
    DISPLAY " ".
    DISPLAY "SCHEDA N. " WS-INDICE " DI 8 - FINE TRASMISSIONE.".
    DISPLAY "STOP RUN.".
    STOP RUN.
